Repository: LuisRojoSanz/GreenInHouse2_APP
Catalog: lib/l10n/intl_*.arb
Languages: es

source: Graphs
es: Gráficos

source: Milestones
es: Hitos

source: Home
es: Inicio

source: Settings
es: Ajustes

# screenTitlePlantTips
source: Plant care tips
es: Consejos para tus plantas

# plantTipDescription
source: Tip: {text}
es: Consejo: {text}

# zoneLabel
source: Zone: {zone}
es: Zona: {zone}

# measurementTypeLabel
source: Measurement Type: {type}
es: Tipo de medida: {type}

# rangeLabel
source: Range: {min} - {max}
es: Rango: {min} - {max}

# hoursLabel
source: Min Hours: {min}, Max Hours: {max}
es: Horas mínimas: {min}, Horas máximas: {max}

# noConnectionTitle
source: No connection
es: Sin conexión

# noConnectionMessage
source: Could not connect to the server. Please check your network and ensure the smart pot is powered on and connected to Wi-Fi.
es: No se pudo conectar con el servidor. Por favor, revisa tu conexión de red y que la maceta esté funcionando y conectada a la red wifi.

# noConnectionAccept
source: OK
es: Aceptar

source: Select days
es: Selecciona los días

source: Accept
es: Aceptar

source: Days back:
es: Días atrás:

source: Update Graph
es: Actualizar Gráfica

# noData
source: No data available
es: No hay datos disponibles

# dateTimeAxis
source: Date and Time
es: Fecha y Hora

# percentageAxis
source: Percentage (%)
es: Porcentaje (%)

# daysCount
source: {count} days
es: {count} días

# degrees
source: Temperature (ºC)
es: Temperatura (ºC)

# humiditySensor
source: HUMIDITY
es: HUMEDAD

# ambienthumiditySensor
source: AMBIENT HUMIDITY
es: HUMEDAD AMBIENTE

# luminositySensor
source: LUMINOSITY
es: LUMINOSIDAD

# temperatureSensor
source: TEMPERATURE
es: TEMPERATURA

# loadingMessage
source: Loading...
es: Cargando...

source: Completed
es: Completado

source: Pending
es: Pendiente

source: Cancel
es: Cancelar

# soilMoistureLow
source: Water the plant, it needs more moisture.
es: Riega la planta, necesita más agua.

# soilMoistureHigh
source: Don't water it more, the soil is too wet.
es: No riegues más, el suelo está demasiado húmedo.

# soilMoistureOptimal
source: Soil moisture is in the optimal range.
es: Humedad del suelo en rango óptimo.

# airHumidityLow
source: Increase air humidity, place a humidifier nearby.
es: Aumenta la humedad del aire, pon un humidificador cerca.

# airHumidityHigh
source: Reduce humidity, ventilate the area.
es: Reduce la humedad, ventila el espacio.

# airHumidityOptimal
source: Air humidity is in the optimal range.
es: Humedad del ambiente en rango óptimo.

# lightLow
source: The plant needs more light, move it to a brighter spot.
es: La planta necesita más luz, colócala en un lugar más iluminado.

# lightHigh
source: The plant is getting too much light, place it in the shade.
es: La planta recibe demasiada luz, ponla en sombra.

# lightOptimal
source: Light levels are in the optimal range.
es: Luminosidad en rango óptimo.

# temperatureLow
source: It's too cold, move the plant to a warmer place.
es: Hace demasiado frío, acerca la planta a un lugar más cálido.

# temperatureHigh
source: It's too hot, keep the plant away from direct sunlight.
es: Hace demasiado calor, aleja la planta del sol.

# temperatureOptimal
source: Temperature is in the optimal range.
es: Temperatura en rango óptimo.

# milestonesTitle
source: Milestones
es: Hitos

# milestonesProgress
source: Milestone Progress
es: Progreso de Hitos

source: Daily Milestones
es: Hitos Diarios

source: Monthly Milestones
es: Hitos Mensuales

source: Soon to change
es: Pronto a cambiar

source: Soon to add
es: Pronto a añadir

# recentSoilChange
source: Recent soil change, all good.
es: Cambio de tierra reciente, todo en orden.

# soilChangeInLessThanMonth
source: Less than a month left for the next soil change
es: Queda menos de un mes para el cambio de tierra

# soilChangeOverdue
source: Change the plant's soil, the scheduled time has passed.
es: Cambia la tierra de la planta, ya ha pasado el tiempo definido.

source: Next change
es: Próximo cambio

# confirmSoilChangeTitle
source: Confirm soil change
es: Confirmar cambio de tierra

# confirmSoilChangeQuestion
source: Have you changed the plant's soil?
es: ¿Has cambiado la tierra de la planta?

# yesChanged
source: Yes, I changed it
es: Sí, la cambié

source: Fertilizer recently added.
es: Fertilizante añadido recientemente.

# fertilizerInLessThanMonth
source: Less than a month to add fertilizer again
es: Queda menos de un mes para volver a añadir fertilizante

# fertilizerOverdue
source: Add fertilizer, the scheduled time has passed
es: Añade fertilizante, ya ha pasado el plazo definido

source: Next application
es: Próxima aplicación

# confirmFertilizerTitle
source: Confirm fertilizer
es: Confirmar fertilizante

# confirmFertilizerQuestion
source: Have you added fertilizer to the plant?
es: ¿Has añadido fertilizante a la planta?

# yesAdded
source: Yes, I did
es: Sí, lo he hecho

# newPlantFertilizerMessage
source: New plant created, fertilizer is needed
es: Creación de nueva planta, se requiere de fertilizante

# newPlantSoilMessage
source: Newly created plant, mark if soil change is done
es: Planta recién creada, marca si el cambio de tierra está hecho.

# photoNeedsPlant
source: You must create a plant before adding a photo
es: Debes crear una planta antes de añadir una foto

source: Take photo
es: Tomar foto

source: Choose from gallery
es: Elegir de galería

source: Remove photo
es: Quitar foto

# confirmPhotoRemoval
source: Confirm removal
es: Confirmar eliminación

# areYouSureRemovePhoto
source: Are you sure you want to remove the photo?
es: ¿Estás seguro de que quieres quitar la foto?

source: Yes, remove
es: Sí, eliminar

source: Tap to add photo
es: Pulsa para añadir foto

# settingsTitle
source: Settings
es: Ajustes

source: ✨ Show Milestones
es: ✨ Mostrar Hitos

# milestoneSoilMoisture
source: Soil Moisture
es: Humedad del Suelo

# milestoneAmbientHumidity
source: Ambient Humidity
es: Humedad Ambiente

# milestoneLight
source: Light
es: Luz

# milestoneTemperature
source: Temperature
es: Temperatura

# milestoneSoilChange
source: Soil Change
es: Cambio de Tierra

# milestoneFertilizer
source: Fertilizer
es: Fertilizante

# soilChangeFrequency
source: ⏳ Soil change frequency (days)
es: ⏳ Frecuencia del cambio de tierra (días)

# fertilizerFrequency
source: ⏳ Fertilizer frequency (days)
es: ⏳ Frecuencia del fertilizante (días)

# change_language
source: Language
es: Idioma

source: Spanish
es: Español

source: English
es: Inglés

source: Active Sensors
es: Sensores Activos

# errorFetchingData
source: No data retrieved
es: No recoge datos

# withOutData
source: No data
es: Sin datos

source: Unknown name
es: Nombre desconocido

source: Unknown model
es: Modelo desconocido

source: Unknown type
es: Tipo desconocido

# unknownZone
source: Unspecified zone
es: Zona no especificada

source: No reading
es: Sin lectura

source: No unit
es: Sin unidad

source: Model
es: Modelo

source: Type
es: Tipo

source: Zone
es: Zona

source: Last reading
es: Última lectura

# completeFieldsMessage
source: Please complete all fields
es: Por favor, completa todos los campos

# tipoPlantaCreatedMessage
source: Plant type created successfully
es: Tipo de planta creado correctamente

# step1Title
source: Step 1: Select or Create Plant Type
es: Paso 1: Seleccionar o Crear Tipo de Planta

# tipoPlantaLabel
source: Plant Type
es: Tipo de Planta

# createNewTipoPlanta
source: Create a new plant type
es: Crear un nuevo tipo de planta

# nombreTipoPlantaLabel
source: Plant Type Name
es: Nombre del Tipo de Planta

# descripcionPlantaLabel
source: Plant Type Description
es: Descripción del Tipo de Planta

# guardarTipoPlantaButton
source: Save Plant Type
es: Guardar Tipo de Planta

# step2Title
source: Step 2: Create Plant
es: Paso 2: Crear Planta

# nombrePlantaLabel
source: Plant Name
es: Nombre de la Planta

# crearPlantaButton
source: Create Plant
es: Crear Planta

# deletePlantTitle
source: Delete Plant
es: Eliminar Planta

# selectActivePlantToDelete
source: Select an active plant to delete:
es: Selecciona una planta activa para eliminar:

# activePlantsLabel
source: Active Plants
es: Plantas Activas

# deletePlantButton
source: Delete Plant
es: Eliminar Planta

# selectPlantToDelete
source: Please select a plant to delete
es: Por favor, selecciona una planta para eliminar

# confirmDeleteTitle
source: Confirm Deletion
es: Confirmar eliminación

# confirmDeleteMessage
source: Are you sure you want to delete the plant "{plantName}"?
es: ¿Estás seguro de que quieres eliminar la planta "{plantName}"?

source: Delete
es: Eliminar

# plantDeletedMessage
source: Plant deleted successfully
es: Planta eliminada correctamente

# noActivePlantTitle
source: No active plant
es: Sin planta activa

# noActivePlantMessage
source: No active plant detected. Please create one before continuing.
es: No se ha detectado ninguna planta activa. Por favor, crea una planta antes de continuar.

source: Understood
es: Entendido

source: Days with life
es: Días con vida

# plantName
source: Indoor Plant
es: Planta de Interior

source: View Plant Tips
es: Ver Consejos de Plantas

# drawer_header
source: List of Options
es: Opciones

# menu_create_plant
source: Create Plant
es: Crear Planta

# title
source: Plant Creation
es: Creación de Plantas

# menu_modify_plant
source: Modify Plant
es: Modificar Planta

# menu_delete_plant
source: Delete Plant
es: Eliminar Planta

# menu_sensor_check
source: Sensor Check
es: Comprobación Sensores

# modifyPlantTitle
source: Modify Plant
es: Modificar Planta

# selectPlantToModify
source: Select an active plant to modify:
es: Selecciona una planta activa para modificar:

# plantNameLabel
source: Plant Name
es: Nombre de la Planta

# newPlantTypeLabel
source: New Plant Type
es: Nuevo Tipo de Planta

# modifyPlantButton
source: Modify Plant
es: Modificar Planta

# selectPlantAndTypeMessage
source: Please select a plant and a new type
es: Por favor, selecciona una planta y un nuevo tipo

# plantTypeModifiedMessage
source: Plant type successfully modified
es: Tipo de planta modificado correctamente

source: Loading state...
es: Cargando estado...

# veryBadState
source: Very poor condition
es: Muy mal estado de cuidado

# badState
source: Poor condition
es: Mal estado de cuidado

# regularState
source: Fair condition
es: Regular estado de cuidado

# goodState
source: Good condition
es: Buen estado de cuidado

# veryGoodState
source: Very good condition
es: Muy buen estado de cuidado

# unknownState
source: Unknown
es: Desconocido

# healthStatus
source: State of care: {percent}%
es: Estado de salud: {percent}%

# nameLabel
source: Plant Name
es: Nombre de la Planta

# typeLabel
source: Plant Type
es: Tipo de Planta

# plantDateLabel
source: Planting Date
es: Fecha de Plantación

# maxTempLabel
source: Max Temperature (°C)
es: Temperatura Máxima (°C)

# minTempLabel
source: Min Temperature (°C)
es: Temperatura Mínima (°C)

# maxHumidityLabel
source: Max Humidity (%)
es: Humedad Máxima (%)

# minHumidityLabel
source: Min Humidity (%)
es: Humedad Mínima (%)

# maxLightLabel
source: Max Light Hours (h)
es: Horas Máximas de Luz (h)

# minLightLabel
source: Min Light Hours (h)
es: Horas Mínimas de Luz (h)

# waterLabel
source: Daily Water (ml)
es: Agua Diaria (ml)

# addPlantButton
source: Add Plant
es: Añadir Planta

# pleaseEnterName
source: Please enter the plant name
es: Por favor, ingresa el nombre de la planta

# tempMinGreaterThanMax
source: Min temperature cannot be greater than max
es: La temperatura mínima no puede ser mayor que la máxima

# humidityMinGreaterThanMax
source: Min humidity cannot be greater than max
es: La humedad mínima no puede ser mayor que la máxima

# lightMinGreaterThanMax
source: Min light hours cannot be greater than max
es: La luz mínima no puede ser mayor que la máxima

# plant_info
source: Type: {type} Planting Date: {date} Max Temp: {maxTemp}°C Min Temp: {minTemp}°C Max Humidity: {maxHumidity}% Min Humidity: {minHumidity}% Light: {minLight}-{maxLight}h Water: {water}ml/day
es: Tipo: {type} Fecha de Plantación: {date} Temp Máx: {maxTemp}°C Temp Mín: {minTemp}°C Humedad Máx: {maxHumidity}% Humedad Mín: {minHumidity}% Luz: {minLight}-{maxLight}h Agua: {water}ml/día

# plantaCreatedMessage
source: Plant created successfully
es: Planta creada correctamente

# welcomeMessage
source: TOMATO
es: TOMATERA

# plantStatus
source: In good condition
es: En buen estado

# plantHealth
source: Health Status: 75%
es: Estado de Salud: 75%

source: View Details
es: Ver Detalles

# appTitleplants
source: Plant Tips
es: Consejos de Plantas

# screenTitleplants
source: Plant Tips
es: Consejos de Plantas

# errorMessage
source: Could not fetch plant tips
es: No se pudieron obtener los consejos

# unitLabel
source: Unit: {unit}
es: Unidad: {unit}

# appTitlesensors
source: Active Sensors
es: Sensores Activos

# screenTitlesensors
source: Active Sensors
es: Sensores Activos

# errorMessagesensors
source: Could not fetch sensors
es: No se pudieron obtener los sensores

# modelLabel
source: Model: {model}
es: Modelo: {model}

# typeLabelsensors
source: Type: {type}
es: Tipo: {type}

# readingLabel
source: Reading: {reading} {unit}
es: Lectura: {reading} {unit}

source: Please enter all fields.
es: Por favor, rellene todos los campos.

# plantCreatedSuccess
source: Plant created successfully!
es: ¡Planta creada con éxito!

source: Error creating plant
es: Error al crear la planta

# errorConnectingToServer
source: Error connecting to the server.
es: Error al conectar con el servidor.
